/*
    সমস্যার বিবরণ ঃ  
    কোন একটি পূর্ণ সংখ্যা দেওয়া থাকবে, সেটি জোড় না বিজোড়, তা বের করতে হবে ।

    ইনপুট
    প্রথম লাইনে একটি সংখ্যা T (1 <= T <= 100) দেওয়া থাকবে । পরবর্তী সময়ে T-এর মান যত, ততটি লাইন থাকবে 
    প্রতিটি লাইনে একটি করে পূর্ণসংখ্যা n (0 <= n <=2147483647) দেওয়া থাকবে ।

*/

#include <stdio.h>

int main()
{
    int T, i, n;

    scanf("%d", &T);

    for (i = 1; i <= T; i++)
    {
        scanf("%d", &n);

        if (n % 2 == 0)
        {
            printf("even\n");
        }
        else
        {
            printf("odd\n");
        }
    }
    return 0;
}